## ✅ Terraform K8s Plan: `terraform/infrastructure/nonprod-k8s/network`

**Status:** success
**Commit:** 7517801
**Workflow Run:** [#7](https://github.com/100-hours-a-week/9-team-Devths-CLOUD/actions/runs/23324057703)

<details>
<summary>📋 Show K8s Plan Output</summary>

```terraform
==========================================
Terraform K8s Plan
==========================================
Stack: nonprod-k8s/network
Working directory: /home/runner/work/9-team-Devths-CLOUD/9-team-Devths-CLOUD/terraform/infrastructure/nonprod-k8s/network

::group::terraform init (nonprod-k8s/network)

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
- s3_artifact in ../../../modules/s3
- s3_loki in ../../../modules/s3
- s3_tempo in ../../../modules/s3
- vpc in ../../../modules/vpc

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
::endgroup::

::group::terraform plan (nonprod-k8s/network)
aws_iam_role.nat_instance: Refreshing state... [id=Devths-NAT-Instance-NonProd]
module.s3_artifact.aws_s3_bucket.this: Refreshing state... [id=devths-v3-artifact-nonprod]
aws_iam_policy.nat_cloudwatch_metrics: Refreshing state... [id=arn:aws:iam::174678835309:policy/Devths-NAT-CloudWatch-Metrics-NonProd]
module.s3_tempo.aws_s3_bucket.this: Refreshing state... [id=devths-v3-monitoring-tempo-nonprod]
aws_iam_role_policy_attachment.nat_ssm: Refreshing state... [id=Devths-NAT-Instance-NonProd-arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
aws_iam_role_policy.nat_ssm_logs: Refreshing state... [id=Devths-NAT-Instance-NonProd:Devths-NAT-SSM-Logs-NonProd]
aws_iam_role_policy_attachment.nat_cloudwatch_metrics: Refreshing state... [id=Devths-NAT-Instance-NonProd-arn:aws:iam::174678835309:policy/Devths-NAT-CloudWatch-Metrics-NonProd]
aws_iam_instance_profile.nat_instance: Refreshing state... [id=Devths-NAT-Instance-NonProd]
aws_iam_role_policy.nat_ssm_s3_logs: Refreshing state... [id=Devths-NAT-Instance-NonProd:Devths-NAT-SSM-S3-Logs-NonProd]
module.vpc.data.aws_region.current: Reading...
module.vpc.data.aws_ami.amazon_linux_nat[0]: Reading...
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0f3ee6964daef09bb]
module.vpc.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.vpc.data.aws_ami.amazon_linux_nat[0]: Read complete after 2s [id=ami-02196008b76e66ca6]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0fab00cd60e7e0208]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f25b08e2efaa1fca]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-03fcaff41e973514c]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-01c809a10519d3584]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-09299037ce3130277]
module.vpc.aws_security_group.nat_instance[0]: Refreshing state... [id=sg-07bd69abc27ded2de]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0f209946947c07123]
module.vpc.aws_security_group.vpc_endpoints: Refreshing state... [id=sg-095613fae9e0d2f6b]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0f9d969deab35dbed]
module.vpc.aws_security_group.alb: Refreshing state... [id=sg-0a3926512158dd4fe]
aws_security_group.k8s_master: Refreshing state... [id=sg-063a2ed0ca82de5e0]
aws_security_group.k8s_worker: Refreshing state... [id=sg-048fb467af3775414]
module.s3_tempo.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=devths-v3-monitoring-tempo-nonprod]
module.s3_tempo.aws_s3_bucket_versioning.this: Refreshing state... [id=devths-v3-monitoring-tempo-nonprod]
module.s3_tempo.aws_s3_bucket_public_access_block.this: Refreshing state... [id=devths-v3-monitoring-tempo-nonprod]
module.s3_artifact.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=devths-v3-artifact-nonprod]
module.s3_tempo.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=devths-v3-monitoring-tempo-nonprod]
module.s3_artifact.aws_s3_bucket_public_access_block.this: Refreshing state... [id=devths-v3-artifact-nonprod]
module.s3_artifact.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=devths-v3-artifact-nonprod]
module.s3_artifact.aws_s3_bucket_versioning.this: Refreshing state... [id=devths-v3-artifact-nonprod]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-031aaf83e18706ce3]
module.vpc.aws_eip.nat_instance[0]: Refreshing state... [id=eipalloc-054db8c906a83f0d7]
module.vpc.aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-079a963d8ccf22753]
module.vpc.aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-0ddee955c20562bbd]
module.vpc.aws_instance.nat[0]: Refreshing state... [id=i-09fe3bff219f82016]
aws_vpc_security_group_egress_rule.k8s_worker_all: Refreshing state... [id=sgr-0ee085e4e77083355]
aws_vpc_security_group_ingress_rule.k8s_worker_http["0.0.0.0/0"]: Refreshing state... [id=sgr-0b19f89d9ff056858]
aws_vpc_security_group_ingress_rule.k8s_worker_overlay_from_workers: Refreshing state... [id=sgr-06a0ded60c86bf73a]
aws_vpc_security_group_ingress_rule.k8s_worker_https["0.0.0.0/0"]: Refreshing state... [id=sgr-0f6a7c770f4cb3810]
aws_vpc_security_group_ingress_rule.k8s_worker_nodeport["0.0.0.0/0"]: Refreshing state... [id=sgr-0704fd2bb313d91e5]
aws_vpc_security_group_egress_rule.k8s_master_all: Refreshing state... [id=sgr-0525cb329281163b0]
aws_vpc_security_group_ingress_rule.k8s_worker_kubelet_from_master: Refreshing state... [id=sgr-054afcfa4e6d785ae]
aws_vpc_security_group_ingress_rule.k8s_master_overlay_from_control_plane: Refreshing state... [id=sgr-08d7c6d818801e8db]
aws_vpc_security_group_ingress_rule.k8s_worker_overlay_from_master: Refreshing state... [id=sgr-09198d97a01cc9513]
aws_vpc_security_group_ingress_rule.k8s_master_kubelet_from_workers: Refreshing state... [id=sgr-0821022b93fed1d1a]
aws_vpc_security_group_ingress_rule.k8s_master_overlay_from_workers: Refreshing state... [id=sgr-0b8dead3b936fa329]
aws_vpc_security_group_ingress_rule.k8s_master_api_server_from_workers: Refreshing state... [id=sgr-0aec670268b59b15c]
aws_vpc_security_group_ingress_rule.k8s_master_http["0.0.0.0/0"]: Refreshing state... [id=sgr-0203102b4bed04875]
aws_vpc_security_group_ingress_rule.k8s_master_https["0.0.0.0/0"]: Refreshing state... [id=sgr-0c2f1724c09491615]
aws_vpc_security_group_ingress_rule.k8s_master_nodeport["0.0.0.0/0"]: Refreshing state... [id=sgr-037e4066e14942c8e]
aws_vpc_security_group_ingress_rule.k8s_master_intra_control_plane: Refreshing state... [id=sgr-0bcf73e7a8f4f59fc]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02f581a8e4ec52d58]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c93b2fbed92b3603]
module.vpc.aws_eip_association.nat_instance[0]: Refreshing state... [id=eipassoc-033a840b01d8eaee3]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-00b9f6096b550704b]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-047d2fce0490075b9]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0372834230e3b0259]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-087fe214071570972]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03fbafec378043284]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05b1846380718e812]
module.vpc.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-07830a8fa2890bf6f]
module.vpc.aws_vpc_endpoint_policy.s3: Refreshing state... [id=vpce-07830a8fa2890bf6f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_security_group.k8s_master must be replaced
+/- resource "aws_security_group" "k8s_master" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:174678835309:security-group/sg-063a2ed0ca82de5e0" -> (known after apply)
      ~ description            = "K8s Control Plane SG for devths nonprod" -> "Security group for Kubernetes control-plane nodes" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-063a2ed0ca82de5e0" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "Calico Pod CIDR"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = "API Server"
              - from_port        = 6443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 6443
            },
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = "Node Exporter "
              - from_port        = 9100
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 9100
            },
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = "Prometheus"
              - from_port        = 9090
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 9090
            },
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = "kubelet/scheduler/controller"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 10259
            },
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = "node - node"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "172.16.10.0/24",
                ]
              - description      = "etcd"
              - from_port        = 2379
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 2380
            },
          - {
              - cidr_blocks      = []
              - description      = "Certmanager"
              - from_port        = 9443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-048fb467af3775414",
                ]
              - self             = false
              - to_port          = 9443
            },
        ] -> (known after apply)
      ~ name                   = "devths-V3-nonprod-master-sg" -> "devths-v3-nonprod-k8s-master-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "174678835309" -> (known after apply)
      + revoke_rules_on_delete = false
      ~ tags                   = {
          + "Architecture" = "3-tier"
          + "Cluster"      = "devths-nonprod-k8s"
          + "Environment"  = "nonprod"
          + "ManagedBy"    = "Terraform"
          ~ "Name"         = "devths-V3-nonprod-master-sg" -> "devths-v3-nonprod-k8s-master-sg"
          + "Project"      = "devths"
          + "Role"         = "control-plane"
          + "Version"      = "v3"
          + "Workload"     = "kubernetes"
        }
      ~ tags_all               = {
          + "Architecture" = "3-tier"
          + "Cluster"      = "devths-nonprod-k8s"
          + "Environment"  = "nonprod"
          + "ManagedBy"    = "Terraform"
          ~ "Name"         = "devths-V3-nonprod-master-sg" -> "devths-v3-nonprod-k8s-master-sg"
          + "Project"      = "devths"
          + "Role"         = "control-plane"
          + "Version"      = "v3"
          + "Workload"     = "kubernetes"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.k8s_worker must be replaced
+/- resource "aws_security_group" "k8s_worker" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:174678835309:security-group/sg-048fb467af3775414" -> (known after apply)
      ~ description            = "K8s Worker Node SG for devths nonprod" -> "Security group for Kubernetes worker nodes" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-048fb467af3775414" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/16",
                ]
              - description      = "Calico Pod"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = "Node Exporter(Alloy)"
              - from_port        = 9100
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 9100
            },
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = "Node"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = "OTLP HTTP (Tempo, Alloy)"
              - from_port        = 4318
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 4318
            },
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = "OTLP gRPC (Tempo, Alloy)"
              - from_port        = 4317
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 4317
            },
          - {
              - cidr_blocks      = [
                  - "172.16.0.0/16",
                ]
              - description      = "kubelet"
              - from_port        = 10250
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 10250
            },
          - {
              - cidr_blocks      = []
              - description      = "NodePort HTTP (NLB - Worker)"
              - from_port        = 30080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-07ef2720651c4500b",
                ]
              - self             = false
              - to_port          = 30080
            },
          - {
              - cidr_blocks      = []
              - description      = "NodePort HTTPS (NLB - Worker)"
              - from_port        = 30443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-07ef2720651c4500b",
                ]
              - self             = false
              - to_port          = 30443
            },
          - {
              - cidr_blocks      = []
              - description      = "prometheus remote write"
              - from_port        = 9090
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0f4c23e0e5e99aa96",
                ]
              - self             = false
              - to_port          = 9090
            },
        ] -> (known after apply)
      ~ name                   = "devths-V3-nonprod-worker-sg" -> "devths-v3-nonprod-k8s-worker-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "174678835309" -> (known after apply)
      + revoke_rules_on_delete = false
      ~ tags                   = {
          + "Architecture" = "3-tier"
          + "Cluster"      = "devths-nonprod-k8s"
          + "Environment"  = "nonprod"
          + "ManagedBy"    = "Terraform"
          ~ "Name"         = "devths-V3-nonprod-worker-sg" -> "devths-v3-nonprod-k8s-worker-sg"
          + "Project"      = "devths"
          + "Role"         = "worker"
          + "Version"      = "v3"
          + "Workload"     = "kubernetes"
        }
      ~ tags_all               = {
          + "Architecture" = "3-tier"
          + "Cluster"      = "devths-nonprod-k8s"
          + "Environment"  = "nonprod"
          + "ManagedBy"    = "Terraform"
          ~ "Name"         = "devths-V3-nonprod-worker-sg" -> "devths-v3-nonprod-k8s-worker-sg"
          + "Project"      = "devths"
          + "Role"         = "worker"
          + "Version"      = "v3"
          + "Workload"     = "kubernetes"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_vpc_security_group_egress_rule.k8s_master_all must be replaced
-/+ resource "aws_vpc_security_group_egress_rule" "k8s_master_all" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-0525cb329281163b0" -> (known after apply)
      ~ id                     = "sgr-0525cb329281163b0" -> (known after apply)
      ~ security_group_id      = "sg-0fb9b68bf11d1e637" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0525cb329281163b0" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_vpc_security_group_egress_rule.k8s_worker_all must be replaced
-/+ resource "aws_vpc_security_group_egress_rule" "k8s_worker_all" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-0ee085e4e77083355" -> (known after apply)
      ~ id                     = "sgr-0ee085e4e77083355" -> (known after apply)
      ~ security_group_id      = "sg-05d94d4f915fbce25" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0ee085e4e77083355" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.k8s_master_api_server_from_workers must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "k8s_master_api_server_from_workers" {
      ~ arn                          = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-0aec670268b59b15c" -> (known after apply)
      ~ id                           = "sgr-0aec670268b59b15c" -> (known after apply)
      ~ referenced_security_group_id = "sg-05d94d4f915fbce25" -> (known after apply)
      ~ security_group_id            = "sg-0fb9b68bf11d1e637" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-0aec670268b59b15c" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.k8s_master_http["0.0.0.0/0"] must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "k8s_master_http" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-0203102b4bed04875" -> (known after apply)
      ~ id                     = "sgr-0203102b4bed04875" -> (known after apply)
      ~ security_group_id      = "sg-0fb9b68bf11d1e637" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0203102b4bed04875" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.k8s_master_https["0.0.0.0/0"] must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "k8s_master_https" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-0c2f1724c09491615" -> (known after apply)
      ~ id                     = "sgr-0c2f1724c09491615" -> (known after apply)
      ~ security_group_id      = "sg-0fb9b68bf11d1e637" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0c2f1724c09491615" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.k8s_master_intra_control_plane must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "k8s_master_intra_control_plane" {
      ~ arn                          = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-0bcf73e7a8f4f59fc" -> (known after apply)
      ~ id                           = "sgr-0bcf73e7a8f4f59fc" -> (known after apply)
      ~ referenced_security_group_id = "sg-0fb9b68bf11d1e637" -> (known after apply)
      ~ security_group_id            = "sg-0fb9b68bf11d1e637" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-0bcf73e7a8f4f59fc" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.k8s_master_kubelet_from_workers must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "k8s_master_kubelet_from_workers" {
      ~ arn                          = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-0821022b93fed1d1a" -> (known after apply)
      ~ id                           = "sgr-0821022b93fed1d1a" -> (known after apply)
      ~ referenced_security_group_id = "sg-05d94d4f915fbce25" -> (known after apply)
      ~ security_group_id            = "sg-0fb9b68bf11d1e637" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-0821022b93fed1d1a" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.k8s_master_nodeport["0.0.0.0/0"] must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "k8s_master_nodeport" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-037e4066e14942c8e" -> (known after apply)
      ~ id                     = "sgr-037e4066e14942c8e" -> (known after apply)
      ~ security_group_id      = "sg-0fb9b68bf11d1e637" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-037e4066e14942c8e" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.k8s_master_overlay_from_control_plane must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "k8s_master_overlay_from_control_plane" {
      ~ arn                          = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-08d7c6d818801e8db" -> (known after apply)
      ~ id                           = "sgr-08d7c6d818801e8db" -> (known after apply)
      ~ referenced_security_group_id = "sg-0fb9b68bf11d1e637" -> (known after apply)
      ~ security_group_id            = "sg-0fb9b68bf11d1e637" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-08d7c6d818801e8db" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.k8s_master_overlay_from_workers must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "k8s_master_overlay_from_workers" {
      ~ arn                          = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-0b8dead3b936fa329" -> (known after apply)
      ~ id                           = "sgr-0b8dead3b936fa329" -> (known after apply)
      ~ referenced_security_group_id = "sg-05d94d4f915fbce25" -> (known after apply)
      ~ security_group_id            = "sg-0fb9b68bf11d1e637" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-0b8dead3b936fa329" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.k8s_worker_http["0.0.0.0/0"] must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "k8s_worker_http" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-0b19f89d9ff056858" -> (known after apply)
      ~ id                     = "sgr-0b19f89d9ff056858" -> (known after apply)
      ~ security_group_id      = "sg-05d94d4f915fbce25" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0b19f89d9ff056858" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.k8s_worker_https["0.0.0.0/0"] must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "k8s_worker_https" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-0f6a7c770f4cb3810" -> (known after apply)
      ~ id                     = "sgr-0f6a7c770f4cb3810" -> (known after apply)
      ~ security_group_id      = "sg-05d94d4f915fbce25" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0f6a7c770f4cb3810" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.k8s_worker_kubelet_from_master must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "k8s_worker_kubelet_from_master" {
      ~ arn                          = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-054afcfa4e6d785ae" -> (known after apply)
      ~ id                           = "sgr-054afcfa4e6d785ae" -> (known after apply)
      ~ referenced_security_group_id = "sg-0fb9b68bf11d1e637" -> (known after apply)
      ~ security_group_id            = "sg-05d94d4f915fbce25" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-054afcfa4e6d785ae" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.k8s_worker_nodeport["0.0.0.0/0"] must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "k8s_worker_nodeport" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-0704fd2bb313d91e5" -> (known after apply)
      ~ id                     = "sgr-0704fd2bb313d91e5" -> (known after apply)
      ~ security_group_id      = "sg-05d94d4f915fbce25" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id = "sgr-0704fd2bb313d91e5" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.k8s_worker_overlay_from_master must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "k8s_worker_overlay_from_master" {
      ~ arn                          = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-09198d97a01cc9513" -> (known after apply)
      ~ id                           = "sgr-09198d97a01cc9513" -> (known after apply)
      ~ referenced_security_group_id = "sg-0fb9b68bf11d1e637" -> (known after apply)
      ~ security_group_id            = "sg-05d94d4f915fbce25" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-09198d97a01cc9513" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_vpc_security_group_ingress_rule.k8s_worker_overlay_from_workers must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "k8s_worker_overlay_from_workers" {
      ~ arn                          = "arn:aws:ec2:ap-northeast-2:174678835309:security-group-rule/sgr-06a0ded60c86bf73a" -> (known after apply)
      ~ id                           = "sgr-06a0ded60c86bf73a" -> (known after apply)
      ~ referenced_security_group_id = "sg-05d94d4f915fbce25" -> (known after apply)
      ~ security_group_id            = "sg-05d94d4f915fbce25" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-06a0ded60c86bf73a" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.s3_loki.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "devths-v3-monitoring-loki-nonprod"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Architecture" = "3-tier"
          + "Environment"  = "nonprod"
          + "ManagedBy"    = "Terraform"
          + "Name"         = "devths-v3-monitoring-loki-nonprod"
          + "Project"      = "devths"
          + "Purpose"      = "Loki Log Storage"
          + "Version"      = "v3"
        }
      + tags_all                    = {
          + "Architecture" = "3-tier"
          + "Environment"  = "nonprod"
          + "ManagedBy"    = "Terraform"
          + "Name"         = "devths-v3-monitoring-loki-nonprod"
          + "Project"      = "devths"
          + "Purpose"      = "Loki Log Storage"
          + "Version"      = "v3"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3_loki.aws_s3_bucket_lifecycle_configuration.this[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "this" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "delete_old_logs"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = false
            }

          + filter {
            }
        }
      + rule {
          + id     = "delete_old_versions"
          + status = "Enabled"

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 7
            }
        }
    }

  # module.s3_loki.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.s3_loki.aws_s3_bucket_server_side_encryption_configuration.this will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.s3_loki.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Suspended"
        }
    }

Plan: 23 to add, 0 to change, 18 to destroy.

Changes to Outputs:
  ~ k8s_master_security_group_id   = "sg-063a2ed0ca82de5e0" -> (known after apply)
  ~ k8s_master_security_group_name = "devths-V3-nonprod-master-sg" -> "devths-v3-nonprod-k8s-master-sg"
  ~ k8s_worker_security_group_id   = "sg-048fb467af3775414" -> (known after apply)
  ~ k8s_worker_security_group_name = "devths-V3-nonprod-worker-sg" -> "devths-v3-nonprod-k8s-worker-sg"
  + loki_bucket_arn                = (known after apply)
  + loki_bucket_name               = "devths-v3-monitoring-loki-nonprod"
  + nat_eip_public_ips             = [
      + "43.200.32.26",
    ]
  + nat_gateway_ids                = []
::endgroup::

✅ Terraform K8s plan completed for nonprod-k8s/network

```

</details>

---
*Triggered by @Hyeseong-Myeong on 2026-03-20T00:46:56.781Z*